Flow Past Cylinder/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     icoFoam;

startTime       0;

endTime         120;

deltaT          0.02;

writeControl    adjustableRunTime;

writeInterval   1;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable	yes;

adjustTimeStep	yes;

maxCo		0.5;

libs 		( "libforces.so" "libOpenFOAM.so" "libfieldFunctionObjects.so");
 
functions
{
	readFields
	{
		libs ( "libfieldFunctionObjects.so" );
		type readFields;
		fields (p U);
	}
	forces
	{
		type forceCoeffs;
		libs ( "libforces.so" );
		writeControl timeStep;
		writeInterval 1;
		patches ("walls");
		pName p;
		UName U;
		rho rhoInf;
		log true;
		rhoInf 1;
		liftDir (0 1 0);
		dragDir (1 0 0);
		CofR (0 0 0);
		pitchAxis (0 1 0);
		magUInf 1.0;
		lRef 1.0;
		Aref 1.0;
	}
}

// ************************************************************************* //
