Flow Past Cylinder/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
// General macros to create 2D/extruded-2D meshes








// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale 1.0;


vertices
(
(-15 10 0) // Vertex p0b = 0 
(-2.12132033784832 10 0) // Vertex p1b = 1 
(2.12132034546342 10 0) // Vertex p2b = 2 
(45 10 0) // Vertex p3b = 3 

(-15 2.12132034546342 0) // Vertex p4b = 4 
(-2.12132033784832 2.12132034546342 0) // Vertex p5b = 5 
(2.12132034546342 2.12132034546342 0) // Vertex p6b = 6 
(45 2.12132034546342 0) // Vertex p7b = 7 

(-0.353553389641386 0.35355339091057 0) // Vertex p8b = 8 
(0.35355339091057 0.35355339091057 0) // Vertex p9b = 9 

(-0.353553389641386 -0.353553389641386 0) // Vertex p10b = 10 
(0.35355339091057 -0.353553389641386 0) // Vertex p11b = 11 

(-15 -2.12132033784832 0) // Vertex p12b = 12 
(-2.12132033784832 -2.12132033784832 0) // Vertex p13b = 13 
(2.12132034546342 -2.12132033784832 0) // Vertex p14b = 14 
(45 -2.12132033784832 0) // Vertex p15b = 15 

(-15 -10 0) // Vertex p16b = 16 
(-2.12132033784832 -10 0) // Vertex p17b = 17 
(2.12132034546342 -10 0) // Vertex p18b = 18 
(45 -10 0) // Vertex p19b = 19 

// * * * * * * * * * * * * * * //

(-15 10 1) // Vertex p0t = 20 
(-2.12132033784832 10 1) // Vertex p1t = 21 
(2.12132034546342 10 1) // Vertex p2t = 22 
(45 10 1) // Vertex p3t = 23 

(-15 2.12132034546342 1) // Vertex p4t = 24 
(-2.12132033784832 2.12132034546342 1) // Vertex p5t = 25 
(2.12132034546342 2.12132034546342 1) // Vertex p6t = 26 
(45 2.12132034546342 1) // Vertex p7t = 27 

(-0.353553389641386 0.35355339091057 1) // Vertex p8t = 28 
(0.35355339091057 0.35355339091057 1) // Vertex p9t = 29 

(-0.353553389641386 -0.353553389641386 1) // Vertex p10t = 30 
(0.35355339091057 -0.353553389641386 1) // Vertex p11t = 31 

(-15 -2.12132033784832 1) // Vertex p12t = 32 
(-2.12132033784832 -2.12132033784832 1) // Vertex p13t = 33 
(2.12132034546342 -2.12132033784832 1) // Vertex p14t = 34 
(45 -2.12132033784832 1) // Vertex p15t = 35 

(-15 -10 1) // Vertex p16t = 36 
(-2.12132033784832 -10 1) // Vertex p17t = 37 
(2.12132034546342 -10 1) // Vertex p18t = 38 
(45 -10 1) // Vertex p19t = 39 
);
blocks
(


    hex (4 5 1 0 24 25 21 20) (20 20 1) simpleGrading (0.05 15 1)	//1
    hex (5 6 2 1 25 26 22 21) (60 20 1) simpleGrading (1 15 1)		//2
    hex (6 7 3 2 26 27 23 22) (60 20 1) simpleGrading (8 15 1)		//3
    hex (12 13 5 4 32 33 25 24) (20 60 1) simpleGrading (0.05 1 1)	//4

    hex (13 10 8 5 33 30 28 25) (40 60 1) simpleGrading (0.005 1 1)	//c1
    hex (8 9 6 5 28 29 26 25) (60 40 1) simpleGrading (1 200 1)	//c2
    hex (11 14 6 9 31 34 26 29) (40 60 1) simpleGrading (200 1 1)	//c3
    hex (13 14 11 10 33 34 31 30) (60 40 1) simpleGrading (1 0.005 1)	//c4
    
    hex (14 15 7 6 34 35 27 26) (60 60 1) simpleGrading (8 1 1)	//5
    hex (16 17 13 12 36 37 33 32) (20 20 1) simpleGrading (0.05 0.06 1)	//6
    hex (18 19 15 14 38 39 35 34) (60 20 1) simpleGrading (8 0.06 1)	//8
    hex (17 18 14 13 37 38 34 33) (60 20 1) simpleGrading (1 0.06 1)	//7

);
edges
(
arc  11 9 (0.5 0 0)
arc  9 8 (8.97448368482705e-10 0.5 0)
arc  10 8 (-0.5 1.79489673696541e-09 0)
arc  11 10 (-2.69234510544812e-09 -0.5 0)

arc  14 6 (3 0 0)
arc  6 5 (5.38469021089623e-09 3 0)
arc  13 5 (-3 1.07693804217925e-08 0)
arc  14 13 (-1.61540706326887e-08 -3 0)

//***********************************************************************//
arc  31 29 (0.5 0 1)
arc  29 28 (8.97448368482705e-10 0.5 1)
arc  30 28 (-0.5 1.79489673696541e-09 1)
arc  31 30 (-2.69234510544812e-09 -0.5 1)

arc  34 26 (3 0 1)
arc  26 25 (5.38469021089623e-09 3 1)
arc  33 25 (-3 1.07693804217925e-08 1)
arc  34 33 (-1.61540706326887e-08 -3 1)
);

patches
(
    wall walls
    (
        (28 8 9 29)
        (29 9 11 31)
        (31 11 10 30)
        (30 10 8 28)
    )

    patch inlet
    (
        (24 4 0 20)
        (32 12 4 24)
        (36 16 12 32)
    )
    patch outlet
    (
        (23 3 7 27)
        (27 7 15 35)
        (35 15 19 39)
    )
    patch sides
    (
        (0 1 21 20)
        (1 2 22 21)
        (2 3 23 22)
        (36 37 17 16 )
        (37 38 18 17)
        (38 39 19 18)
    )
    empty lowerUpper
    (
        (20 21 25 24)
        (21 22 26 25)
        (22 23 27 26)
        (24 25 33 32)
        (25 26 29 28)
        (25 28 30 33)
        (29 26 34 31)
        (30 31 34 33)
        (26 27 35 34)
        (32 33 37 36)
        (33 34 38 37)
        (34 35 39 38)

        (0 4 5 1)
        (1 5 6 2)
        (2 6 7 3)
        (4 12 13 5)
        (5 8 9 6)
        (5 13 10 8)
        (9 11 14 6)
        (10 13 14 11)
        (6 14 15 7)
        (12 16 17 13)
        (13 17 18 14)
        (14 18 19 15)

    )
);

mergPatchPairs
(
);

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

