Flow Past Cylinder/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         backward;
}

gradSchemes
{
    default         none;
    grad(p)         Gauss linear;
    grad(U)		Gauss linear;
    snGradCorr(U) 	Gauss linear;
    snGradCorr(p) 	Gauss linear;
}

divSchemes
{
    default         none;
    div(phi,U)      Gauss linear;
}

laplacianSchemes
{
    default 		none;
    laplacian(nu,U) 	Gauss linear corrected;
    laplacian((1|A(U)),p) 	Gauss linear corrected;
}

interpolationSchemes
{
	default 	linear;
	interpolate(U)	linear;
}

snGradSchemes
{
	default         corrected;
}

fluxRequired
{
	default no;
 	p	;
}



// ************************************************************************* //
